Repository: eugeneai/bash-essentials-ru-handbok
Catalog: tmx/en-ru-level2.tmx
Source language: en
Languages: ru

source: The theory allows one to apply regular approaches of continuous mathematic to the search Nash equilibrium, resulting in less combinatorial and complex computation.
ru: Теория позволяет применить обычные подходы непрерывной математики для поиска равновесия Нэша, в результате чего уменьшается комбинаторная сложность вычислений.

source: The theory started to attract scientific attention after publication of J.M. Lasry and P.L.
ru: Эта теория началя привлекать внимание ученых после публикаций J.M. Lasry и P.L.

source: The third one, named Alpha-diversity, deals with representation of the similarities of the groups (samples) on the base of inhabiting OTU and sequences and vice versa (similarities of the OTU on the base of groups).
ru: Третий, названный Альфа-разнообразием, касается представления сходства групп (выборок) на основе OTU или индивидуальных последовательностей, а также сходства OTU на основе групп.

source: The top command is great because it acts as a process management tool and system management tool all in one.
ru: Программа top очень удобна как инструмент управления и процессами и системой.

source: The top command is great for getting a high level overview of things in regards to process/system utilization, but we have a few more commands that will give greater insight into how our computer is functioning.
ru: Команда top отлично подходит для получения общего обзора состояния компьютера, касающихся использования его ресурсов, но есть еще несколько команд, которые дают более полное представление о том, как работает компьютер.

source: The topics are as follows.
ru: Темы следующие.

source: The traceroute command is a great way to understand how your computer locates and routes your request to www.thediygolfer.com.
ru: Команда traceroute - отличный способ понять, как компьютер находит сервер и через какие маршрутизаторы проходит запрос на www.thediygolfer.com.

source: The trajectory, which reaches the modeling horizon corresponds to the synthesized control driving the system int an intermediate, but admissible state.
ru: Траектории, которые достигают горизонта моделирования соответствуют синтезированному управлению системой, а конечное состояние хоть и промежуточное, но допустимомое.

source: The transformation is also implemented as logical inference realizing a pattern recognition.
ru: Преобразование - логический вывод, реализующий распознавание образов.

source: The transformation obeys a scenario of IS construction in the image and likeness of Model Driven Architecture paradigm.
ru: Трансформация подчиняется сценарию проектирования ИС, реализующему принципы Модельно-управляемой архитектуры (Model-driven architecture, MDA).

source: The transformation resulted in an information system carcass comprising database layer, object-relation layer, application layer, user interface elements, importing templates and routines, objects for report generation; totally 19 various aspects were generated.
ru: Трансформация создала каркас информационной системы, включающий слой базы данных, уровень объектов и отношений между ними, фасть слоя бизнес-догики, элементы пользовательского интерфейса, шаблоны и процедуры импорта, структуры и часть методов объекты, упрощающих порождение отчетов; всего в каркасе сгенерировано 19 различных аспектов ИС.

source: The transportation between the mirror storages and the computer systems for processing data could easy cause the network capacity exhausting.
ru: Транспортировка данных между зеркальными хранилищами и компьютерными системами для обработки данных легко приводит к исчерпанию емкости сети.

source: The trim.flows command is analogous to the trim.seqs command, except that it uses the flowgram data that comes bundled in the sff file that is generated by 454 sequencing.
ru: Команда ```trim.flows``` является аналогом ```trim.seqs```, за исключением того, что использует данные ```flowgram```, которые комплектуются с файлом .sff, порождаемые 454-секвенированием.

source: The trim.seqs command provides the preprocessing features needed to screen and sort pyrosequences.
ru: Команда ```trim.seqs``` вычисляет значения признаков, необходимых для скрининга и сортировки результатов пиросеквенирования.

source: The two expressions above both match the four email addresses while excluding the other two lines.
ru: Два приведенных выше выражения соответствуют четырем адресам электронной почты, исключая две другие строки.

source: The ultimate conclusion about regular expressions??
ru: Что нам глобально дает испольщование регулярных выражений??

source: The uncertainties appear in the system thanks to activities of competitors or internal factors having probabilistic nature and represented as internal events or shortage of resources.
ru: Неопределенности в системе появляются из-за деятельности конкурентов или внутренних факторов, имеющих вероятностный характер и представлены как внутренние события или нехватка ресурсов.

source: The unique.seqs command returns only the unique sequences found in a fasta-formatted sequence file and a file that indicates those sequences that are identical to the reference sequence.
ru: Команда ```unique.seqs``` выбирает только уникальные последовательности, найденные в последовательностях, представленных в ```fasta```-файлах, а также файлах с перечислением последовательностей, которые идентичны референтным последовательностям.

source: The usage of the logic object-oriented language Logtalk in the model transformation instead of standard ATL, QVT approaches allows one to use both power of logical inference and the expressiveness of object-oriented programming systems, as well as the integration with existing libraries in within the same programming system.
ru: Использование логикого объектно-ориентированного языка Logtalk для трансформации моделей вместо стандартных ATL и QVT позволяет использовать и средства логического вывода и выразительность систем объектно-ориентированного программирования, а также интегрироваться с существующими библиотеками в рамках одной системы программирования.

source: The very rare instances of readings are considered to be chimeric and removed.
ru: Очень редкие случаи чтения считаются химерными и удаляются.

source: The “Date” part of the regex makes sense, but what does the “.+” mean?
ru: Часть «Date» в регулярном выражении в принципе понять несложно, а что означает часть «.+»?

source: Then we walk through the list of sequences looking for rarer sequences that are within some threshold of the original sequence.
ru: Затем он проходит по списку последовательностей и ищет редко встречающиеся последовательности, количество которых находится в рамках порогового значения исходной последовательности.

source: Then, in the first regex, we replaced .{1,} with [a-zA-Z0-9]{1,} which will now not match the “yahoo.com.yahoo.com” because the periods do not match the character set.
ru: Затем в первом регулярном выражении заменен .{1,} на [a-zA-Z0-9]{1,}, который теперь не будет соответствовать «yahoo.com.yahoo.com», потому что точки не входят в набор символов.

source: There a several more options you can explore, but these commands should get you started with compression/archive utilities.
ru: Есть еще несколько других флагов, управляющих работой с утилит сжатия / архивирования.

source: There are also three other “special” characters that we can use to match certain types of characters.
ru: Есть также еще три других специальных символа, которые соответствуют другим типам символов.

source: There are configuration options for the command, but the only one that you need to know is the -c option, which will allow you to specify the number of packets to request from a given source.
ru: У команды есть различные флаги, но единственное, что вам нужно знать сейчас, - это флаг -c, позволяющий указывать количество пакетов, которые мы хотим отправить серверу.

source: There are endless possibilities to writing bash scripts.
ru: Есть практически бесконечные количество возможностей использования сценариев bash.

source: There are four main analyzes carried over the processed sequence sets (groups, samples).
ru: Над обработанными наборами последовательностей (группы, образцы) производятся, в основном, четыре вида анализов.

source: There are many ways to utilize this tool, but here are a couple that any bash user might find useful at some point.
ru: Есть много способов использования этого инструмента, но вот пара вариантов, которые в какой-то момент могут пригодиться любому пользователю bash.

source: There are multiple ways that internet can reach your home, but the most common is through telephone wires (UTP cables).
ru: Технологии предоставляют несколько способов "доставки" Интернета в дом, но наиболее распространенным является провода UTP.

source: There are only a few commands that we need to look at here because these few commands will take care of essentially anything we would ever need to do relating to processes.
ru: Здесь есть несколько команд, позволяющих ??? позаботятся практически обо всем, что нам когда-либо понадобится в отношении процессов.

source: There are other bash tools like nslookup, route, etc., but the ones I have reviewed will take care of most user needs.
ru: Существуют и другие инструменты bash, например, nslookup, route и т.д., но которые были рассмотренв, удовлетворят большинству потребностей пользователей.

source: There are rare relations between resources, which are not stored in the conventional databases.
ru: Между ресурсами встречаются редкие отношения, которые не хранятся в обычных базах данных.

source: There are several built in variables that you can use in a bash script.
ru: Есть несколько встроенных переменных, которые можно использовать в сценарии bash.

source: There are textbooks written on the topic, and therefore, I have no chance of covering everything you need to know relating to networking.
ru: По этой теме написано много книг и учебников, поэтому не будем рассматривать все вопросы.

source: There are three entries in my configuration.
ru: В данной конфигурации есть три записи.

source: There are two commands that give us output relating to the processes that are currently running on our computer.
ru: Есть две команды, показывающие процессы, выполняемые в настоящее время на нашем компьютере.

source: There is also a command called time that will tell you how much CPU time a particular command takes.
ru: Также есть команда под названием time, показывающая сколько процессорного времени занимает выполнение конкретной программы.

source: There is also data like the maximum transmission units (MTU) which is the maximum size of a packet on this device, and RX/TX packets which indicate how many packets have been transmitted to and from this network.
ru: Также есть данные, такие как максимальный размер пакета (MTU) и счетчики пакетов RX/TX, которые указывают, сколько пакетов было передано в локальную сеть и из нее.

source: There is no abbreviation for the character class [1-5] and therefore we must utilize it.
ru: Т.к. нет соответствующего класса, нужно использовать [1-5].

source: There will be 5 lines here, and starting from the top line (1) going to the bottom line (5), let’s get a better idea of what this means.
ru: Экран включает пять строк, начиная с верхней строки (1) и заканчивая нижней строкой (5), разберем, какую информацию они отображают.

source: Therefore, I will not be listing out all of the available testing options and will assume you have read through the man page for test.
ru: Поэтому мы не будем перечислять все доступные варианты использования test и предполагаем знакомиться с руководством test.

source: Therefore, researchers put forward the cooperative distributed predictive control method.
ru: Поэтому исследования начали проводиться в области кооперативных методов распределенного предиктивного управления.

source: Therefore, the nowadays control structures of large-scale networked industrial processes is decentralized and distributed.
ru: Поэтому, в настоящее время структуры управления крупномасштабными распределенными промышленными процессами являются также децентрализованными и распределеннвми.

source: Therefore, this expression
ru: Следовательно, это выражение

source: These are just a couple of the thousands of possibilities here.
ru: Это всего лишь несколько из тысячи других функций программы.

source: These are what we call “quantifiers”, and they are extremely important.
ru: Эти конструкции называются “кванторами” и являются очень важными в формировании регулярных выражений.

source: These both relate to the topic of “groups”, which allows you to group different parts of your regular expression.
ru: Оба этих сивола относятся к теме «группы», которая позволяет группировать различные части вашего регулярного выражения.

source: These can be running, stopped, sleeping, or zombie.
ru: Задачи могут находиться в состоянии running (выполняется), stopped (остановлен), sleeping (простой) или zombie (зомби).

source: These character classes are not necessary in most cases and I would encourage you to use \d rather than [0-9] whenever possibly for utmost brevity.
ru: Такой подход позволяет как минимум сокращать размер выражения.

source: These columns are not included in calculating distances because they have no information in them.
ru: Эти столбцы не учитываются в процессе вычисления расстояний, потому что не представляют собой никакой полезной информации.

source: These commands are useful for quick info relating to your network and external networks.
ru: Но эти команды также полезны для получения информации о вашей сети и о внешних сетях.

source: These languages are declarative based, but have imperative extensions, allowing, e.g., analyzing and conversion of string parts.
ru: Эти языки декларативные, но есть императивные расширения, позволяющие, например, задавать алгоритмы анализа и преобразования строковых данных.

source: These models in form of XNI-files are loaded in an object-logical environment constructed as network of objects of the Logtalk language.
ru: Эти модели в виде XNI-файлов загружаются в объектно-ориенированную логическую среду, построенную как сеть объектов языка Logtalk.

source: These notations can be used for RDDESU representation, especially SysML, which domains are description of complex systems, including software, organizations, processes etc.
ru: Эти языки можно использовать для представления РУДССН, особенно подходит SysML, имопльзуемый для описания сложных систем, включая программное обеспечение, организации, процессы и т.д.

source: These represent the output of the ls command that you would see if you just ran ls in the current directory of my machine.
ru: Файлы представляют собой результат выполнения команды ls в текущем каталоге моей машины.

source: These states are intuitive, except a zombie process, which is just a process that is killed but still showing up in the process table (usually because the parent process has failed to clean it up).
ru: Суть их интуитивно понятна, за исключением процессов в состоянии зомби. Такие процессы является всего лишь процессами, которые погибают, но все еще перечислены в таблице процессов, как правило, потому, что родительский процесс не смог вычистить его ресуры.

source: These uncertainties are modeled either “in overage”, e.g., as probability to finish production in time, or an average resource loss.
ru: Эти неопределенности моделируются либо “в среднем”, например, как вероятность того, что выпуск продукции произойдет в срок, или как средние потери ресурсов.

source: These utilities are fairly simple and used to compress and decompress files.
ru: Эти утилиты не имеют какого-то сложного набора функций и используются для сжатия и распаковки файлов.

source: These values will be constantly increasing.
ru: Эти значения постоянно увеличиваться.

source: They are listed below.
ru: Они перечислены ниже.

source: They can also become useful when you are writing a bash script and need a built-in text editor.
ru: Они также полезны когда вы пишете сценарий для bash, где нужно как-то редактировать текст или изымать оттуда информацию.

source: This IP address is the local identifier which can be translated into the public IP for the network by combining it with the subnet mask which is also listed.
ru: Этот IP-адрес является локальным, который нужно преобразовать во "внешний" IP-адрес сети, объединив его с маской подсети.

source: This IP address represents all the devices on the network and is where traffic leaves and enters.
ru: Этот IP-адрес представляет все устройства в сети, через него уходит и входит трафик Интернет.

source: This IP will always be within the address space as defined by the subnet mask.
ru: Этот IP-адрес всегда будет в адресном пространстве, определенном маской подсети.

source: This actually does the fork and exec all in one.
ru: Фактически, это fork и exec одновременно.

source: This allows researcher information to figure out parameters for next operations.
ru: Полученная информация позволяет определять параметры для следующих операций.

source: This allows us rapidly transit from one implementation platform to another conserving gained and formalized experience.
ru: Это позволяет нам быстро переходить от одной платформы внедрения к другой, сохраняя полученный и формализованный опыт.

source: This allows us to carry on the following steps once per unique sequence, resulting in reduction of computational time.
ru: Это позволяет нам выполнять следующие шаги один раз для каждой уникальной последовательности, что сокращает время вычислений.

source: This analysis allowed medical engineers to focus studying on vaccine development.
ru: Этот анализ позволил медицинским инженерам сосредоточить внимание на разработке вакцины.

source: This approach is called “multi-agent”, following that every STS is represented as a set of active entities, called agents, operating independently in accordance with their internal logics.
ru: Этот подход называется “мульти-агентным”, в соответствии с ним каждай СТО представлен как совокупность активных субъектов, называемых агентами, действующих самостоятельно в согласно их внутренней логики.

source: This approach uses Tabdoc model to represent semantic documents with heterogeneous contexts in a semantically consistent manner.
ru: Этот подход использует модели Tabdoc для представления семантических документов с разнородными контекстами семантически непротиворечиво.

source: This brings us to the topic of local area networks, or LANs.
ru: Здесь подходим к локальным сетям.

source: This can be achieved with a set of rules recognizing the unsatisfactory state, analyze its properties, and add new actions to the schedule to move the system to admissible states.
ru: Это достигается при помощи набора правил, распознающих состояние, притворечащих спецификации, анализирующих его свойства, и порождения возможных действий в плане-расписании производства для перевода системы в некоторое допустимое состояние.

source: This command can also be used to set new configurations, but for our use, we will just look at the output.
ru: Эту команду также можно использовать для установки новых настроек, но нам достаточно просто посмотреть на результат.

source: This command can be run inside bash scripts to obtain necessary information.
ru: Команда используется внутри скриптов bash для получения необходимой информации.

source: This command gives information about the various networking protocols (TCP/IP, UDP, ICMP, etc.) that your machine is using.
ru: Эта команда предоставляет информацию о различных сетевых протоколах (TCP/IP, UDP, ICMP и т.д.), используемые компьютером.

source: This command is useful in cases where you do not have a browser to test internet connectivity.
ru: Команда полезна в случаях отсутствия браузера для проверки подключения к Интернету.

source: This command may be used in conjunction with the list.seqs command to help screen a sequence collection.
ru: Эта команда используется совместно с ```list.seqs``` в процессе скрининга наборов последовательностей.

source: This command may not be installed by default on your machine, so if it is not available, you will need to install it.
ru: Эта команда может не быть установлена на компьютере по умолчанию, в этом случае ее нужно установить.

source: This command will allow you to partition your flowgram data by sample based on the barcode, trim the flows to a specified length range, and cull sequences that are too short or have too many mismatches to barcodes and primers.
ru: Эта команда позволяет разделять данные ```flowgram``` по образцам на основе штрих-кодов, оставлять в ```flow```-данных отрезки, соответствующие заданному диапазону изменения длины, а также отбраковывать последовательности, которые являются слишком короткими или содержат слишком много несоответствий штрих-кодам и праймерам.

source: This command will list all of the files on your computer that are greater than 1 Gigabyte in size.
ru: Эта команда перечислит все файлы на компьютере, размер которых больше 1 гигабайта.

source: This data is a bit confusing in its current state because it has multiple versions of the stock price (open, high, low, close, adjusted).
ru: В этих данных в текущем их состоянии цена акций задается в нескольких столбцах (open, high, low, close, adjusted), что можно подправить.

source: This does not have any customization (i.e. you cannot send a custom signal), but is a quick way to kill a process without breaking out of top.
ru: Программа не позволяет указывать, какой сигнал требуется послать, но это быстрый способ убить процесс, не покидая программу top.

source: This does not make a lot of sense starting out, but once you know how a process starts, you will gain clarity into what goes on behind the scenes on your computer.
ru: Как только вы изучите процедуру загрузки системы, вы поймете, что происходит за кулисами на компьютере.

source: This entire time, I have not even mentioned “character classes”, which are expressions contained within [].
ru: Все это время классы символов, которые представляют собой выражения, содержащиеся в [], даже не были упомянуты.

source: This expression matches
ru: Это выражение соответствует

source: This extends to digits too.
ru: Это распространяется и на цифры.

source: This file is called simple-script.sh where the .sh is the file extension for the script (not necessary, but good practice).
ru: Файл скрипта называется simple-script.sh где .sh - это расширение файла для сценария (оно не обязательно должно быть таким, но рекомендуется именно так его задавать).

source: This formulation of the problem is the object of game theory (GT) of modern operational research, and the object is referred to as Resource-Based Conflict (RBC).
ru: Такая постановка проблемы является предметом теории игр (ТИ) и исследования операций, а объект исследования - конфликт, ресурсный кнфликт (РК, resource-based conflict), а ресурсы, которыми владеют агенты - это их ресурсная база (РБ).

source: This information along with the rest is put into a “packet”, which is then sent to the router over the connection between the router and your computer’s wireless card.
ru: Эта информация вместе с остальной помещается в “packet”, который затем отправляется маршрутизатору через соединение между маршрутизатором и беспроводной картой вашего компьютера.

source: This is a common type of script that you might have to write.
ru: Такие операции очень часто можно найти сценариях, и вам, возможно, придется разрабатывать что-то подобное.

source: This is a perfect opportunity to introduce the “metacharacters”.
ru: Это прекрасная возможность представить «метасимволы».

source: This is a perfect set of text for us to use to learn regular expressions.
ru: Эти ответы - идеальный текст, который будем далее использовать для изучения регулярных выражений.
